src/Catalogs/СостояниеЗубнойФормулы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СостояниеЗубнойФормулы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбластьЗубнойФормулы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиЗубнойФормулы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловноеОбозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ОбластиЗубнойФормулы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОбластиЗубнойФормулы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Корень1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корень2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корень3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Канал1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Канал2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Канал3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоверхностьЦентр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоверхностьЛево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоверхностьПраво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоверхностьВерх</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоверхностьНиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штифт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Абатмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоронкаПротез</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоронкаЗуб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Десна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кость</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СостояниеЗубнойФормулы/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, выполняет заполнение состояний зубной формулы
//
Процедура ЗаполнитьОбластиЗубнойФормулы() Экспорт
	
	МассивНаименований = Новый Массив;
	
	// Поверхность
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Кариес", Перечисления.ОбластиЗубнойФормулы.ПоверхностьЦентр, "#a18265", "С"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Пломба стеклоиномерная", Перечисления.ОбластиЗубнойФормулы.ПоверхностьЦентр, "#4d67b1"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Пломба фотополимерная", Перечисления.ОбластиЗубнойФормулы.ПоверхностьЦентр, "#976cdf"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Реставрация", Перечисления.ОбластиЗубнойФормулы.ПоверхностьЦентр, "#d0eba6"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Старая пломба", Перечисления.ОбластиЗубнойФормулы.ПоверхностьЦентр, "#d57a21"));
	
	// Коронка зуб
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Аттачмен", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#ce90d3"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Кламмер", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#518b7d"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Коронка металлокерамическая", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#3283d4"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Простой бюгель", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#d3d31b"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Сложный бюгель", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#866e56"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Съемный протез", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#a9a9a9"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Фасетка керамическая", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#dbd4cc"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Фасетка металокерамическая", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#abcdf2"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Шинирование", Перечисления.ОбластиЗубнойФормулы.КоронкаЗуб, "#87aa4e"));
	
	// Корень
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Культевая вкладка", Перечисления.ОбластиЗубнойФормулы.Корень1, "#d0daea"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Штифт анкерный", Перечисления.ОбластиЗубнойФормулы.Корень1, "#b88452"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Штифт стекловолоконный", Перечисления.ОбластиЗубнойФормулы.Корень1, "#b292d1"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Штифт углеродоволокнистый", Перечисления.ОбластиЗубнойФормулы.Корень1, "#cd8c93"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО, УО","Штифт парапульпарный", Перечисления.ОбластиЗубнойФормулы.Корень1, "#dbbc5f"));
	
	
	// Канал
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Временно пломбированный канал", Перечисления.ОбластиЗубнойФормулы.Канал1, "#cd20d4"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Мышьяк", Перечисления.ОбластиЗубнойФормулы.Канал1, "#5685b3"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Периодонтит", Перечисления.ОбластиЗубнойФормулы.Канал1, "#f3b8d6", "Pt"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Пломбированный канал", Перечисления.ОбластиЗубнойФормулы.Канал1, "#d5217c"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Пульпит", Перечисления.ОбластиЗубнойФормулы.Канал1, "#87aa4e", "P"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Штифт гуттаперчевый", Перечисления.ОбластиЗубнойФормулы.Канал1, "#d26900"));
	
	
	// Десна
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Вскрытие абсцесса", Перечисления.ОбластиЗубнойФормулы.Десна, "#b34d5a"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Гингивит", Перечисления.ОбластиЗубнойФормулы.Десна, "#eea9ae"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Инъекция линкомицин", Перечисления.ОбластиЗубнойФормулы.Десна, "#1b856e"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Мед. обработка кармана", Перечисления.ОбластиЗубнойФормулы.Десна, "#97b5d1"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Иссечение капюшона", Перечисления.ОбластиЗубнойФормулы.Десна, "#e1e15d"));

	// Кость
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Остеомиелит", Перечисления.ОбластиЗубнойФормулы.Кость, "#ce90d3"));
	
	// Штифт
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Анкерный", Перечисления.ОбластиЗубнойФормулы.Штифт, "#b1c98d"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Стекловолоконный", Перечисления.ОбластиЗубнойФормулы.Штифт, "#cfce00"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Углеродоволокнистый", Перечисления.ОбластиЗубнойФормулы.Штифт, "#f3b8d6"));
	
	// Абатмент
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Керамический", Перечисления.ОбластиЗубнойФормулы.Абатмент, "#e1e15d"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Металический", Перечисления.ОбластиЗубнойФормулы.Абатмент, "#6fa7e2"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Пластиковый", Перечисления.ОбластиЗубнойФормулы.Абатмент, "#61a898"));

	// Коронка протез
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Керамическая", Перечисления.ОбластиЗубнойФормулы.КоронкаПротез, "#949509"));
	МассивНаименований.Добавить(Новый Структура("Наименование, Область, Цвет, УО","Металокерамическая", Перечисления.ОбластиЗубнойФормулы.КоронкаПротез, "#8c8bb7"));
		
	Для Каждого СтрокаТЧ из МассивНаименований Цикл
		
		НовыйЭлемент = Справочники.СостояниеЗубнойФормулы.СоздатьЭлемент();
		НовыйЭлемент.Наименование = СтрокаТЧ.Наименование;
		НовыйЭлемент.Цвет = СтрокаТЧ.Цвет;
		НовыйЭлемент.ОбластьЗубнойФормулы = СтрокаТЧ.Область;
		НовыйЭлемент.УсловноеОбозначение = СтрокаТЧ.УО;
		НовыйЭлемент.Записать();
		
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти
